{
    "id": "68c2753abf800e28fa24ebbd",
    "filename": "issue-364.vi.md",
    "content": "# Tuần san dành cho người đam mê công nghệ (Số 364): Khối Rubik khó phục nguyên nhất — Bản dịch tiếng Việt\n\nNơi lưu lại những nội dung công nghệ đáng chia sẻ hàng tuần, phát hành vào thứ Sáu.\n\nTạp chí này [mã nguồn mở](https://github.com/ruanyf/weekly), hoan nghênh [đóng góp bài viết](https://github.com/ruanyf/weekly/issues). Đồng thời có dịch vụ [《Ai đang tuyển dụng》](https://github.com/ruanyf/weekly/issues/7674) để đăng thông tin tuyển dụng lập trình viên. Liên hệ hợp tác qua [email](mailto:yifeng.ruan@gmail.com) (yifeng.ruan@gmail.com).\n\n## Ảnh bìa\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083002.webp)\n\nDưa hấu cắt lát tại một siêu thị ở Hạ Môn. ([via](https://www.facebook.com/hxdb1234/posts/pfbid0z2PutGZHD3tWu9BDMTmYP8fqFcySML1K8PRvURUvj8QzpPN1zCtEDwrw9e5yhQnCl))\n\n## Khối Rubik khó giải nhất\n\nThật kỳ lạ, tôi quen nhiều lập trình viên, bề ngoài chẳng có điểm chung nào, nhưng khi hỏi ra thì họ đều thích chơi Rubik.\n\nHơn nữa, trình độ của họ đều rất cao, thông thường không quá 3 phút là có thể giải xong khối Rubik.\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090405.webp)\n\nCó một thời gian, trong văn phòng chúng tôi có mấy khối Rubik, lúc rảnh rỗi mọi người lại cầm lên xoay.\n\nTôi từng nghĩ một câu hỏi: **Khối Rubik nào là khó giải nhất?**\n\nCác khối Rubik khác nhau chắc chắn có độ khó giải khác nhau, nhưng làm thế nào để đo lường độ khó?\n\nGần đây, tôi bất ngờ phát hiện vấn đề này ở nước ngoài đã có người [nghiên cứu](https://www.solutionslookingforproblems.com/post/the-rubik-s-cube-perfect-scramble) từ lâu.\n\nHơn nữa, họ đã đề xuất tiêu chuẩn đánh giá: khối Rubik khó giải nhất phải đồng thời thỏa mãn 6 điều kiện sau.\n\n> 1. Mỗi mặt chứa đủ 6 màu.\n> 1. Mỗi mặt không có quá hai khối màu cùng màu.\n> 1. Trên bất kỳ mặt nào, không được có hai khối màu cùng màu liền kề.\n> 1. Trên bất kỳ mặt nào, không được có hai khối màu cùng màu nằm chéo nhau.\n> 1. Tại tám góc, không được có khối màu cùng màu.\n> 6. Hoa văn trên mỗi mặt đều phải khác nhau.\n\nĐáng nể hơn, họ đã viết một [chương trình C++](https://github.com/telemath/PerfectScramble) để tìm ra khối Rubik khó giải nhất.\n\nRubik có tổng cộng 43,252,003,274,489,856,000 cách sắp xếp, máy tính gia đình của họ mất 5 ngày mới chạy xong tất cả tính toán.\n\nCuối cùng phát hiện, **chỉ có một cách sắp xếp duy nhất thỏa mãn sáu yêu cầu trên**.\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025080310.webp)\n\nHoa văn trên đây chính là khối Rubik khó giải nhất.\n\nHoa văn này bao gồm 6 mặt của khối Rubik. Do 6 mặt này có thể kết hợp ngẫu nhiên, nên tổng cộng có 48 hình thái.\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025080311.webp)\n\n## [Ứng dụng Tuần này] GeeLark: Trợ lý AI cho Marketing Xuyên biên giới\n\nNhiều doanh nghiệp và cá nhân có nhu cầu sử dụng các nền tảng mạng xã hội quốc tế (Facebook, Instagram, X/Twitter, TikTok, YouTube, Reddit, v.v.).\n\nHôm nay, giới thiệu với mọi người một ứng dụng desktop [GeeLark](https://t.wangbase.com/pYrpV), giúp **quản lý tập trung các nền tảng này**, đơn giản, dễ dùng, là trợ thủ đắc lực cho marketing xuyên biên giới và thương mại điện tử toàn cầu.\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090403.webp)\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090401.webp)\n\n**Nó tích hợp sẵn điện thoại đám mây và trình duyệt vân tay**, cho phép tạo nhanh các instance điện thoại trên cloud để truy cập các nền tảng mạng xã hội.\n\nĐiện thoại đám mây mang lại nhiều lợi ích: (1) Mỗi tài khoản có môi trường chạy độc lập, biệt lập, hỗ trợ đăng nhập nhiều tài khoản cùng lúc; (2) Trải nghiệm không khác gì điện thoại thật, thao tác hoàn toàn trên máy tính để bàn; (3) Cung cấp môi trường trình duyệt vân tay, vân tay của mỗi điện thoại đám mây đều khác nhau, không bị nền tảng giới hạn luồng.\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090402.webp)\n\nLần này, phiên bản mới nhất của GeeLark đã bổ sung nhiều tính năng nổi bật.\n\n(1) **Tích hợp AI model lớn**, hỗ trợ giải đáp thắc mắc, tạo và chỉnh sửa video, nuôi dưỡng tài khoản bằng AI, viết nội dung, v.v.\n\nĐặc biệt là tính năng biến ảnh thành video (hình trên), có nhiều model hot để lựa chọn, có thể dùng để nhanh chóng tạo video từ ảnh sản phẩm.\n\n(2) **Tự động hóa thao tác thường dùng**. Ví dụ, trên TikTok, nó có các tính năng như nuôi dưỡng tài khoản bằng AI, tự động đăng video và bộ ảnh, tự động gắn sản phẩm, trợ lý dữ liệu AI, tự động like và bình luận.\n\nĐối với người dùng phổ biến hiện nay là xuất khẩu phim ngắn, nó cung cấp tính năng AI \"neo\" (anchor) để thu hút流量 cho phim ngắn.\n\n(3) **Tự động hóa Reddit**. Đáng chú ý, nó còn ra mắt tính năng tự động hóa Reddit trên cửa hàng template tự động, có thể quản lý tài khoản Reddit bằng AI, tự động đăng nội dung.\n\nCần biết rằng, công cụ tạo AI tham khảo nhiều nhất chính là nội dung từ Reddit, việc làm tốt tự động hóa Reddit sẽ có lợi cho GEO (Tối ưu hóa Công cụ Tạo nội dung - *Content Generation Engine Optimization*) của bạn.\n\n(4) **Tác vụ tùy chỉnh**. Nếu các thao tác tự động hóa tích hợp sẵn là chưa đủ, nó còn cho phép tạo tác vụ tùy chỉnh, đáp ứng nhu cầu vận hành cá nhân hóa.\n\nVí dụ, bạn có thể tự kết nối một model có khả năng nhận dạng hình ảnh vào workflow, để thực hiện nhận dạng thông minh trên màn hình điện thoại đám mây và thực thi các thao tác tự động dựa trên nội dung hình ảnh.\n\n(5) **API mở**. GeeLark cung cấp [API](https://t.wangbase.com/LeK9D), bạn có thể tự lập trình để gọi, tạo instance điện thoại đám mây mới và tác vụ tự động. Nhờ vậy, công dụng và không gian sáng tạo của nó càng lớn hơn.\n\nTóm lại, nếu bạn cần làm marketing xuyên biên giới, quản lý tài khoản trên các nền tảng mạng xã hội quốc tế, GeeLark đáng để dùng thử.\n\nSau khi người dùng/đội nhóm kích hoạt gói dịch vụ, chi phí sẽ được tính theo mức sử dụng, dùng bao nhiêu trả bấy nhiêu, **không tính phí chỗ ngồi (seat fee) theo số thành viên đội**. Hơn nữa, đội có thể thiết lập quyền truy cập độc lập cho từng thành viên, các thành viên không cần biết mật khẩu tài khoản mạng xã hội vẫn có thể thao tác.\n\nChào mừng truy cập trang chủ [geelark.cn](https://www.geelark.cn/?utm_source=ruanyifeng.com&utm_medium=post&utm_campaign=campaign20250905) để tải về dùng thử, cách dùng cụ thể có thể tham khảo [hướng dẫn chính thức](https://t.wangbase.com/XdBPV).\n\n## Tin tức Công nghệ\n\n1. **Hàn Quốc triển khai “[Cảnh sát toàn ảnh](https://www.scmp.com/week-asia/lifestyle-culture/article/3322654/south-korea-deploys-hologram-police-officer-fight-crime-and-its-working)” tại công viên Seoul vào ban đêm.**\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083011.webp)\n\nBạn sẽ thấy một cảnh sát kích thước thật đứng giữa bãi cỏ công viên, biết nói và cử động. Nếu đứng từ xa, bạn khó lòng nhận ra đó chỉ là hình chiếu.\n\nCảnh sát cho biết, trong thời gian thiết bị này hoạt động, tỷ lệ phạm tội tại công viên đã giảm khoảng 22%.\n\n2. **Một lập trình viên Mỹ đã biến một máy pha cà phê cũ thành “[Máy tính-Cà phê](https://www.dougmacdowell.com/coffeematic-pc.html)”.**\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025080201.webp)\n\nThiết bị này vừa hoạt động như một máy tính, vừa là máy pha cà phê, với đầy đủ chức năng của cả hai.\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025080202.webp)\n\nKhó khăn lớn nhất là máy pha cà phê tạo ra hơi nước nhiệt độ cao, trong khi máy tính không được tiếp xúc với nước và cần tản nhiệt. Kết hợp cả hai khiến máy tính khó hoạt động ổn định.\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025080203.webp)\n\n3. **[Meta](https://www.nytimes.com/2025/07/23/science/meta-computer-wristband-reardon.html) phát minh vòng đeo tay điều khiển máy tính.**\n\n![](https://cdn.beekka.com/blogimg/asset/202507/bg2025072802.webp)\n\nChiếc vòng đeo cỡ đồng hồ này được cho là có thể thay thế chuột hay bút cảm ứng để điều khiển máy tính.\n\nNguyên lý hoạt động khá mới lạ: khi ngón tay và lòng bàn tay cử động, chúng tạo ra tín hiệu điện cơ. Vòng đeo sẽ đọc các tín hiệu này và phân tích ý định hành động.\n\n4. **[Lưu trữ năng lượng trong hầm mỏ](https://www.independent.co.uk/tech/gravity-battery-mine-renewable-energy-b2492087.html)**\n\nPhần Lan có một hầm mỏ bỏ hoang sâu 1400m. Một công ty Anh dự định biến nó thành một cục pin lưu trữ năng lượng.\n\n![](https://cdn.beekka.com/blogimg/asset/202402/bg2024021102.webp)\n\nÝ tưởng khá đơn giản: lắp đặt cần cẩu treo vật nặng trong hầm mỏ. Khi có điện dư, dùng nó để kéo vật nặng lên. Khi cần dùng điện, cho vật nặng hạ xuống từ từ, giải phóng thế năng trọng trường để chạy turbine phát điện.\n\n![](https://cdn.beekka.com/blogimg/asset/202402/bg2024021103.webp)\n\nNếu phương pháp này khả thi, các hầm mỏ bỏ hoang có thể được tận dụng làm trạm lưu trữ năng lượng.\n\n5. **[Quảng cáo trên bản đồ](https://www.androidauthority.com/google-maps-pop-up-ad-3458170/)**\n\nGoogle Maps gần đây xuất hiện một dạng quảng cáo mới.\n\nKhi bạn đang dẫn đường, đột nhiên một cửa sổ bật lên (như hình dưới) thông báo bạn có thể tạm dừng ở một địa điểm nào đó.\n\n![](https://cdn.beekka.com/blogimg/asset/202407/bg2024070902.webp)\n\nCó thể tưởng tượng, trong tương lai lộ trình dẫn đường sẽ xuất hiện vô số điểm check-in. Chỉ cần bạn vào cửa hàng quét điện thoại, bạn sẽ nhận được phần thưởng hoặc phiếu giảm giá.\n\n## Bài viết\n\n1、[Xác thực Bot của Cloudflare](https://developers.cloudflare.com/bots/reference/bot-verification/web-bot-auth/) (tiếng Anh)\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083001.webp)\n\nCloudflare với tư cách là nhà cung cấp CDN lớn nhất thế giới đã ra mắt tính năng xác thực bot. Nếu muốn thu thập dữ liệu từ các trang web được họ lưu trữ, bạn phải đăng ký public key và kèm chữ ký vào mỗi request.\n\n2、[Tôi làm kỹ sư tại Anduril](https://joincolossus.com/article/the-amusement-park-for-engineers/) (tiếng Anh)\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083102.webp)\n\nAnduril là một công ty công nghệ quốc phòng mới nổi tại Mỹ, tập trung vào ứng dụng quân sự của máy bay không người lái. Người sáng lập của họ cũng chính là người tạo ra sản phẩm kính AR Oculus, tự nhận sẽ dùng drone để bảo vệ nước Mỹ.\n\nBài viết này do một kỹ sư của họ giới thiệu về hoạt động R&D nội bộ, chứa nhiều chi tiết thú vị, đáng đọc.\n\n3、[Thay thế cache bằng database](https://avi.im/blag/2025/db-cache/) (tiếng Anh)\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090101.webp)\n\nTác giả chia sẻ quan điểm về thời điểm nên query trực tiếp database và khi nào nên dùng cache. So với database, cache có những ưu nhược điểm gì.\n\n4、[Chúng tôi đặt lập trình AI vào một vòng lặp while](https://github.com/repomirrorhq/repomirror/blob/main/repomirror.md) (tiếng Anh)\n\nTác giả viết một đoạn hướng dẫn để AI tự generate code, nếu có vấn đề thì tự submit PR để sửa.\n\nAnh ta đặt đoạn hướng dẫn này vào vòng lặp while rồi đi ngủ. Sáng hôm sau thức dậy xem AI đã tiến triển thế nào. (Spoiler: chỉ một đêm, AI đã tiêu tốn 800 USD.)\n\n5、[Bộ công cụ Python của tôi](https://www.cesarsotovalero.net/blog/i-am-switching-to-python-and-actually-liking-it.html) (tiếng Anh)\n\n![](https://cdn.beekka.com/blogimg/asset/202507/bg2025071711.webp)\n\nTác giả là người mới học Python, bài viết giới thiệu các công cụ phát triển cơ bản anh ta dùng như uv, ruff, ty...\n\n6、[Sự khác biệt giữa CPU AMD và Intel](https://www.xda-developers.com/differences-between-amd-and-intel-cpus/) (tiếng Anh)\n\n![](https://cdn.beekka.com/blogimg/asset/202507/bg2025071709.webp)\n\nAMD và Intel đều sản xuất CPU x86, tuy là sản phẩm đồng chất nhưng bài viết này giải thích sự khác biệt về kiến trúc giữa chúng.\n\n## Công cụ\n\n1. **[sping](https://dseltzer.gitlab.io/sping/)**\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083006.webp)\n\nPhiên bản nâng cao của lệnh ping, hiển thị trực quan độ trễ của từng gói dữ liệu ngay trên terminal.\n\n2. **[Beszel](https://github.com/henrygd/beszel)**\n\n![](https://cdn.beekka.com/blogimg/asset/202505/bg2025052102.webp)\n\nCông cụ giám sát máy chủ nhẹ, tích hợp giao diện web, tham khảo [bài giới thiệu](https://www.xda-developers.com/beszel-feature/).\n\n3. **[WinApps](https://github.com/winapps-org/winapps)**\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090411.webp)\n\nCông cụ chạy ứng dụng Windows trên Linux, tự động khởi động máy ảo để vận hành - khác biệt với Wine (mô phỏng Windows API).\n\nMột công cụ tương tự: [WinBoat](https://github.com/TibixDev/winboat).\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090412.webp)\n\n4. **[YouTube TUI](https://github.com/Siriusmart/youtube-tui)**\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083010.webp)\n\nỨng dụng terminal cho YouTube, cho phép thao tác với YouTube ngay trên dòng lệnh.\n\n5. **[LabPlot](https://labplot.org/)**\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083012.webp)\n\nPhần mềm desktop chuyên về trực quan hóa dữ liệu, biến tập dữ liệu thành nhiều loại đồ thị, được đánh giá cao về tính năng.\n\n6. **[gitlab-to-github](https://github.com/wuuashen/gitlab-to-github)**\n\nScript Python giúp di chuyển toàn bộ repository từ GitLab sang GitHub chỉ với một lệnh. ([@wuuashen](https://github.com/wuuashen/gitlab-to-github) đóng góp)\n\n7. **[Bot chặn quảng cáo Telegram](https://github.com/ramsayleung/bayes_spam_sniper)**\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090201.webp)\n\nBot Telegram mã nguồn mở, sử dụng thuật toán Bayes để tự động chặn bài đăng quảng cáo trong nhóm, xem [bài giới thiệu](https://ramsayleung.github.io/zh/post/2025/%E4%B8%80%E4%B8%AA%E8%87%AA%E5%AD%A6%E4%B9%A0%E7%9A%84telegram%E5%B9%BF%E5%91%8A%E6%8B%A6%E6%88%AA%E6%9C%BA%E5%99%A8%E4%BA%BA/) của tác giả. ([@ramsayleung](https://github.com/ruanyf/weekly/issues/7686) đóng góp)\n\n8. **[Foxel](https://github.com/DrizzleTime/Foxel)**\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090202.webp)\n\nỔ đám mây riêng mã nguồn mở, hỗ trợ tìm kiếm ngữ nghĩa bằng AI. ([@DrizzleTime](https://github.com/ruanyf/weekly/issues/7687) đóng góp)\n\n9. **[StoryMotion](https://storymotion.video/)**\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090406.webp)\n\nTrình chỉnh sửa hoạt hình dựa trên web, tạo hoạt hình phong cách vẽ tay Excalidraw để nhúng vào trang web, lý tưởng cho bài thuyết trình. ([@chunrapeepat](https://github.com/ruanyf/weekly/issues/7695) đóng góp)\n\n10. **[Website Screenshot Online](https://websitescreenshot.online/zh-CN)**\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090413.webp)\n\nTrang web chụp màn hình trực tuyến miễn phí: nhập URL, nhận ảnh chụp trang. Còn có công cụ [ghi video cuộn trang](https://websitescreenshot.online/zh-CN/tools/record-website-video) riêng. ([@cryptobanksy](https://github.com/ruanyf/weekly/issues/7705) đóng góp)\n\n## AI Liên quan\n\n1. [Công cụ Tóm tắt AI Sách điện tử](https://github.com/SSShooter/ebook-to-mindmap)\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025082901.webp)\n\nỨng dụng web này có thể tách sách điện tử (định dạng epub và pdf) theo chương và sử dụng AI để tạo tóm tắt văn bản cùng sơ đồ tư duy cho chương đó, yêu cầu người dùng cung cấp API Key cho mô hình lớn. ([@SSShooter](https://github.com/ruanyf/weekly/issues/7660) đóng góp)\n\n2. [VIVY](https://github.com/liriliri/vivy)\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083101.webp)\n\nỨng dụng desktop cho mô hình tạo ảnh từ văn bản Stable Diffusion. ([@surunzi](https://github.com/ruanyf/weekly/issues/7673) đóng góp)\n\n3. [ApeRAG](https://github.com/apecloud/ApeRAG)\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090203.webp)\n\nNền tảng RAG (Retrieval-Augmented Generation) mã nguồn mở, kết hợp RAG đồ thị, tìm kiếm vector và tìm kiếm toàn văn với AI agent. ([@earayu](https://github.com/ruanyf/weekly/issues/7690) đóng góp)\n\n4. [AI Video Transcriber](https://github.com/wendy7756/AI-Video-Transcriber)\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083104.webp)\n\nCông cụ AI chuyển ngữ & dịch & tóm tắt video, hỗ trợ 30+ nền tảng như YouTube, TikTok, Bilibili. Mã nguồn mở, yêu cầu tự triển khai frontend và backend. ([@wendy7756](https://github.com/ruanyf/weekly/issues/7678) đóng góp)\n\n## Tài nguyên\n\n1、[OpenAnimation](https://github.com/orispok/OpenAnimationApp)\n\n![](https://cdn.beekka.com/blogimg/asset/202508/bg2025083103.webp)\n\nKho lưu trữ này chuyên tổng hợp các hoạt ảnh dựa trên Lottie.\n\n2、[Hướng dẫn nhập môn Jujutsu](https://jj-for-everyone.github.io/)\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090102.webp)\n\nJujutsu là một hệ thống quản lý mã nguồn mới nổi, được cho là dễ sử dụng và dễ hiểu hơn Git. Hướng dẫn tiếng Anh này dành cho những người hoàn toàn chưa biết Git.\n\n3、[Bộ sưu tập 50 bàn phím của tôi](https://aresluna.org/50-keyboards-from-my-collection/)\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090407.webp)\n\nTác giả là một nhà sưu tập bàn phím nước ngoài, liệt kê 50 bàn phím độc đáo nhất của mình.\n\nVí dụ, bàn phím dưới đây được sử dụng theo chiều dọc, và còn được trang bị gương để bạn có thể nhìn thấy các phím.\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090408.webp)\n\nLại ví dụ, bàn phím trên găng tay, dùng tay còn lại để nhập liệu.\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090409.webp)\n\nCòn có một bàn phím mà tất cả phím đều được gắn một lần, có thể thay đổi bất cứ lúc nào.\n\n![](https://cdn.beekka.com/blogimg/asset/202509/bg2025090410.webp)\n\n## Hình ảnh\n\n1. [Thế giới bên trong nhạc cụ](https://www.dpreview.com/photography/5400934096/probe-lenses-and-focus-stacking-the-secrets-to-incredible-photos-taken-inside-instruments)\n\nMột nhạc sĩ nước ngoài đã nảy ra ý tưởng: chúng ta chỉ nhìn thấy bề ngoài của nhạc cụ mỗi ngày, vậy bên trong chúng trông như thế nào?\n\nAnh đã chụp một loạt ảnh bên trong các nhạc cụ, mang đến trải nghiệm thị giác hoàn toàn khác biệt, như bước vào những công trình kiến trúc kỳ lạ.\n\n**Đàn organ ống**\n\n![](https://cdn.beekka.com/blogimg/asset/202506/bg2025060110.webp)\n\n**Đàn violin**\n\n![](https://cdn.beekka.com/blogimg/asset/202506/bg2025060111.webp)\n\n**Đàn piano**\n\n![](https://cdn.beekka.com/blogimg/asset/202506/bg2025060112.webp)\n\n**Đàn cello**\n\n![](https://cdn.beekka.com/blogimg/asset/202506/bg2025060113.webp)\n\n## Tóm tắt\n\n1. [Tại sao Facebook không giữ chân được các nhà khoa học](https://www.facebook.com/InvestYourLifes/posts/pfbid02ZaxVs6ES9UaRcUYddE2P1YSqAfVFYQe59AoZdfHUy8Uy3BZk7dt3rf3d3zH8hP7fl)\n\nGần đây, Facebook đã đầu tư mạnh để thuê nhiều nhân tài AI, nhưng không ít người trong số họ chỉ ở lại một thời gian ngắn rồi nộp đơn xin nghỉ việc. Tại sao lại như vậy?\n\nMột cựu nhân viên đã đưa ra lời giải thích, cho rằng điều này có liên hệ trực tiếp đến sứ mệnh của công ty.\n\nSứ mệnh của Facebook là \"kết nối mọi người\" (connect everyone), không liên quan trực tiếp đến AI. Dù nội bộ công ty có nhiều nhà nghiên cứu, nhưng hướng nghiên cứu chủ yếu là thuật toán xếp hạng và phân tích dữ liệu lớn; Facebook vốn không có nền tảng nghiên cứu AI trong lịch sử.\n\nHơn nữa, nhân viên nghiên cứu tại Facebook không được coi trọng.\n\nNhiều nhà nghiên cứu được tuyển dụng trước đây trong giới học thuật hoặc tại Google/DeepMind có không gian tự do khám phá, có thể thực hiện nghiên cứu dài hạn và tiên phong. Nhưng khi đến Facebook, nghiên cứu AI của họ chủ yếu bị yêu cầu phục vụ cho các mục tiêu nghiệp vụ ngắn hạn như quảng cáo, hệ thống đề xuất và kiểm duyệt nội dung. Các nhà nghiên cứu dễ cảm thấy thiếu tầm nhìn dài hạn hoặc hướng nghiên cứu đột phá.\n\nVề bản chất, Facebook là một công ty internet tiêu dùng vận hành theo triết lý \"move fast\" (di chuyển nhanh), nhấn mạnh vào việc ra mắt nhanh và thúc đẩy nhanh hiệu suất công ty.\n\nDNA này khiến các nhà nghiên cứu cảm thấy thiếu môi trường học thuật và khó duy trì uy tín trong giới chuyên môn.\n\nĐồng thời, bộ phận nghiên cứu và sản phẩm của Facebook bị chia cắt nghiêm trọng, kết quả nghiên cứu khó triển khai trực tiếp vào sản phẩm, và đội ngũ sản phẩm không hoàn toàn hiểu được giá trị nghiên cứu.\n\nNhiều nhà khoa học vì vậy cảm thấy không thể tạo ra đổi mới và thành tựu thực sự tại Facebook, hàng ngày phải bận rộn với nghiệp vụ, và cuối cùng lựa chọn rời đi.\n\nĐiều này cho thấy các công ty lớn chưa chắc đã dùng tiền để độc quyền nhân tài; nếu công ty nhỏ thực sự làm sản phẩm đột phá, họ vẫn có cơ hội lớn thu hút nhân tài.\n\n## Nhận định\n\n1,\n\nMột nghiên cứu tại Mỹ chỉ ra rằng AI tác động mạnh nhất đến việc làm của sinh viên tốt nghiệp từ các trường không danh tiếng, trong khi hầu như không ảnh hưởng đến cơ hội việc làm của cựu sinh viên từ các đại học hàng đầu như Harvard hay MIT.\n\nAI đang đẩy nhanh sự mất giá của bằng cấp từ trường đại học thông thường.\n\n-- [“Tác động của AI đến thị trường lao động”](https://www.facebook.com/rainchamber123/posts/pfbid02UhZG3w4BBw4CB2Wn334x787v3Hvxh24V51aH1DfyTfpCLgUoh9YtsSk9ptaufoECl)\n\n2,\n\nChạy ứng dụng AI trên máy tính cá nhân tiềm ẩn ba rủi ro lớn: nó có thể truy cập dữ liệu riêng tư của bạn, tải nội dung không đáng tin cậy và thực hiện giao tiếp với bên ngoài.\n\n-- [Simon Willison](https://martinfowler.com/articles/202508-ai-thoughts.html)\n\n3,\n\nTrung Quốc có khái niệm “chịu khổ” (吃苦), trong khi Mỹ không tồn tại khái niệm này.\n\n-- [Độc giả Hacker News](https://news.ycombinator.com/item?id=45057112)\n\n4,\n\nLập trình theo vibe thực sự thú vị — bạn chỉ cần sáng tạo ý tưởng, không cần tự viết code. Chỉ khi dùng thử tôi mới nhận ra đây mới là điều tôi thực sự yêu thích.\n\n-- [“Lập trình theo vibe của tôi với tư cách là một VC”](https://kevinkuipers.substack.com/p/vc-for-vibe-coding-a-fresh-new-start)\n\n5,\n\nTrò chơi SEO (Tối ưu hóa Công cụ Tìm kiếm) đã kết thúc từ lâu.\n\nĐa số mọi người vẫn đang nỗ lực để leo top Google, nhưng người dùng thực chất đã rời bỏ nền tảng này. Giờ đây chỉ 27% lượt tìm kiếm diễn ra ở đó, 73% còn lại đều đến từ TikTok, Amazon, Reddit, YouTube, và thậm chí cả ChatGPT.\n\n-- [Neil Patel](https://www.facebook.com/groups/403305889834821/?multi_permalinks=3290520761113305), tác giả sách bán chạy tại Mỹ\n\n## Nhìn lại các số trước\n\n[Ngụ ngôn về lừa, hổ và sư tử](https://www.ruanyifeng.com/blog/2024/09/weekly-issue-317.html) (#317)\n\n[Mùa xuân của 5G sắp tới](https://www.ruanyifeng.com/blog/2023/08/weekly-issue-267.html) (#267)\n\n[Thành phố Tương lai Mới của Ả Rập Xê Út](https://www.ruanyifeng.com/blog/2022/08/weekly-issue-217.html) (#217)\n\n[Trình chặn quảng cáo đã đi quá xa](https://www.ruanyifeng.com/blog/2021/07/weekly-issue-167.html) (#167)\n\n(Hết)",
    "upload_date": "2025-09-11T07:07:38.128000"
  }